# HermiteSurface Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSurface Class
Members See Also
---
A Hermite Surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class HermiteSurface : Surface
```

Visual Basic
---
```text
Public Class HermiteSurface _
	Inherits Surface
```

Visual C++
---
```text
public ref class HermiteSurface : public Surface
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Surface Autodesk.Revit.DB..::..HermiteSurface
# See Also
HermiteSurface Members
Autodesk.Revit.DB Namespace